<a href="https://colab.research.google.com/github/huongd17at089/DS_handbook/blob/master/Pandas_handbook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# Series object


* Series object = sequence of values + a sequence of indices
* ~ python dict ( key : value ~ index ~ value)
* ~ one-dimensional numpy
*   accessed by index
* default case :

In [6]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'd', 'c', 'b'])

*one-dimensional numpy*


*   slicing : masking, explicit index, list of index, ...
*   attributes : ndim, dtype, size , shape, ...

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
data.index

Index(['a', 'd', 'c', 'b'], dtype='object')

In [ ]:
data['a']

0.25

In [ ]:
data.a

0.25

In [ ]:
data['a' : 'c']

a    0.25
d    0.50
c    0.75
dtype: float64

*python dict*


*  key, val, items, ..

In [7]:
'a' in data

True

In [8]:
data.keys()

Index(['a', 'd', 'c', 'b'], dtype='object')

In [10]:
list(data.items())

[('a', 0.25), ('d', 0.5), ('c', 0.75), ('b', 1.0)]

# DataFrame object


*   DataFrame as a sequence of Series objects share the same index
*   ~ two-dimensional NumPy

In [14]:
population = pd.Series(
    {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
)
area = pd.Series(
    {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
)

states = pd.DataFrame(
    {
        "population" : population,
        "area" : area
    }
)
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [ ]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [ ]:
states.columns

Index(['population', 'area'], dtype='object')

*~ dictionary*

In [ ]:
states.area is states["area"]

## Constructing DataFrame objects



*   pd.DataFrame(seri, columns) ->  From a single Series object 
*   pd.DataFrame([{col1: val1 , col2: val2, ...}, {col1: val1 , col3: val3, ...}, ...])-> From a list of dicts
*   pd.DataFrame({ col1: seri1 , col2 : seri2}) -> From a dictionary of Series objects
*   pd.DataFrame(2d_array, columns, index) -> From a two-dimensional NumPy array

#  Index Object


*   ~ immutable array
*   ~ ordered set : &, |, ^ ( intersection, union, difference )

In [4]:
ind = pd.Index([1,2,3,4,5])
ind

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [5]:
ind[::2] #numpy aray

Int64Index([1, 3, 5], dtype='int64')

In [ ]:
ind[1] = 0 //immutable

# Indexers: loc, iloc, and ix


*   loc : index object 
*   iloc : integer index
*   slicing, masking, and fancy indexing

*seri*

In [11]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [12]:
data.loc[1]

'a'

In [13]:
data.iloc[1]

'b'

*dataframe*

In [17]:
states.iloc[:3, :2]

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [18]:
states.loc[:'Illinois', :'pop']

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

# Pandas MultiIndex



*   stack/unstack
*   set(ls_col_name) -> MultiIndex/reset_index(name)
*   Slicing with IndexSlice

In [44]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [45]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [47]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [48]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [49]:
pop = pop.unstack()
pop

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [52]:
pop = pop.stack()
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [53]:
pop.index.names = ["state", "year"]
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## MultiIndex for columns

In [59]:
index = pd.MultiIndex.from_product([[2014, 2013], [2, 1]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2014 2      37.0  36.4  46.0  36.6  44.0  35.3
     1      56.0  37.4  32.0  36.1  41.0  35.9
2013 2      36.0  35.9  20.0  36.4  30.0  37.7
     1      33.0  35.9  44.0  36.9  45.0  35.8

In [55]:
health_data['Guido', 'HR']

year  visit
2013  1        14.0
      2        48.0
2014  1        26.0
      2        37.0
Name: (Guido, HR), dtype: float64

In [62]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      33.0  44.0  45.0
2014 1      56.0  32.0  41.0

In [61]:
health_data = health_data.sort_index()
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      33.0  35.9  44.0  36.9  45.0  35.8
     2      36.0  35.9  20.0  36.4  30.0  37.7
2014 1      56.0  37.4  32.0  36.1  41.0  35.9
     2      37.0  36.4  46.0  36.6  44.0  35.3

## Data Aggregations
mean(level), sum(level), max(level)

In [64]:
health_data.max(level='year', axis = 0)

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
year
2013     36.0  35.9  44.0  36.9  45.0  37.7
2014     56.0  37.4  46.0  36.6  44.0  35.9

In [65]:
health_data.max(level='type', axis = 1)

type          HR  Temp
year visit
2013 1      45.0  36.9
     2      36.0  37.7
2014 1      56.0  37.4
     2      46.0  36.6

# Operating on Data


Pandas inherits much of this functionality from NumPy 
+	add()
-	sub(), subtract()
*	mul(), multiply()
* /	truediv(), div(), divide()
* //	floordiv()
%	mod()
*	pow()

NumPy's broadcasting rules

## seri

In [23]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  0  1  1  0
1  6  5  3  4
2  5  2  7  4

In [24]:
np.add(df, df)

    A   B   C  D
0   0   2   2  0
1  12  10   6  8
2  10   4  14  8

In [25]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [26]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

## dataframe

In [29]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0   9   6
1  17  17

In [30]:
A.stack()

0  A     9
   B     6
1  A    17
   B    17
dtype: int64

In [38]:
A.stack().mean() == A.values.mean()

True

## DataFrame and Series

In [41]:
A - A.iloc[0]

   A   B
0  0   0
1  8  11

In [42]:
A - A.B

    A   B   0   1
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN

In [43]:
A.sub(A.B, axis=0)

   A  B
0  3  0
1  0  0

# Missing data



*   data type =  object (upcast to a floating)
*   isnull(), notnull() : return mask
*   dropna(axis, how, thresh)
*   fillna(axis, method) ( method : ffill, bfill )

# Combining Datasets

## Concat

pd.concat(Ls_df, axis, ignore_index=True)



*   ignore_index=True 
*   verify_integrity=True -> throw exception
*   keys = ls_name
*   ~ join : join='inner'/'outer' ( by index )
- outer join : union col set
- inner join : intersection col set

## append
df1.append(df2) return new object

## Merge

## with col name

In [67]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
pd.merge(df1, df2) # on = employee

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [68]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
pd.merge(df1, df3, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

## with index

In [69]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

## mix index , col

In [70]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

## how/on
* how = inner/outer/left/right -> union of columns 
* on = col name


*   inner : intersection of col value
*   outer : union of col value
*   left : 
*   right :

In [71]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [72]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [73]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [74]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

# GroupBy